{"task_name": "1_tool_organization_correction", "task_description": "scene: Containers: tray, coaster. Objects: hammer, screwdriver, pot-with-plant, book./task: Organize the tools into the tray and the decorative items onto the coaster./action: Pick hammer and place into tray. Pick screwdriver and place into tray (wrong). Pick screwdriver from tray and place into coaster (recovery). Pick pot-with-plant and place onto coaster."}
{"task_name": "2_container_purpose_mismatch_correction", "task_description": "scene: Containers: shoe_box, wooden_box. Objects: stapler, can, mouse, french_fries./task: Store office supplies in the wooden_box and non-office items in the shoe_box./action: Pick stapler and place into shoe_box. Pick can and place into wooden_box (wrong). Pick can from wooden_box and place into shoe_box (recovery). Pick mouse and place into wooden_box. Pick french_fries and place into shoe_box."}
{"task_name": "3_container_color_sorting_correction", "task_description": "scene: Containers: fluted_block, dustbin. Objects: bottle, cup_without_handle, mug, red_block, green_block, yellow_block./task: Sort the blocks by color into the fluted_block and the other objects into the dustbin./action: Pick red_block and place into fluted_block. Pick green_block and place into fluted_block (wrong). Pick green_block from fluted_block and place into dustbin (recovery). Pick yellow_block and place into fluted_block. Pick bottle and place into dustbin. Pick cup_without_handle and place into dustbin. Pick mug and place into dustbin."}
{"task_name": "4_color_block_sorting_correction", "task_description": "scene: Containers: plate, coaster. Objects: red_block, microphone, scanner, green_block./task: Sort the primary color blocks into the plate and the secondary color blocks onto the coaster./action: Pick red_block and place into plate. Pick microphone and place into coaster (wrong). Pick microphone from coaster and place into plate (recovery). Pick green_block and place into coaster."}
{"task_name": "5_color_block_sorting_correction", "task_description": "scene: Containers: wooden_box, table. Objects: blue_block, red_block, green_block, yellow_block, orange_block./task: Sort the primary color blocks into the wooden_box and the secondary color blocks onto the table./action: Pick blue_block and place into wooden_box. Pick red_block (wrong). Pick red_block from wooden_box and place into wooden_box (recovery). Pick green_block and place into wooden_box. Pick yellow_block and place onto table. Pick orange_block and place onto table."}
{"task_name": "6_healthy_food_sorting_correction", "task_description": "scene: Containers: plate, wooden_box. Objects: apple, fork, knife, apple_sauce./task: Place the healthy food items into the plate and the non-food items into the wooden_box./action: Pick apple and place into plate. Pick fork and place into wooden_box (wrong). Pick fork from wooden_box and place into plate (recovery). Pick knife and place into wooden_box. Pick apple_sauce and place into wooden_box."}
{"task_name": "7_sound_device_organization_correction", "task_description": "scene: Containers: fluted_block, shoe_box. Objects: alarm-clock, shampoo, drill, bell, bread./task: Organize the sound-producing devices into the fluted_block and the non-sound-producing items into the shoe_box./action: Pick alarm-clock and place into fluted_block. Pick bell (wrong). Pick bell from shoe_box and place into fluted_block (recovery). Pick drill and place into shoe_box. Pick bread and place into shoe_box."}
{"task_name": "8_healthy_food_classification_correction", "task_description": "scene: Containers: plate, tray. Objects: apple, dumbbell, hamburg./task: Place the healthy food items into the plate and the non-food items into the tray./action: Pick apple and place into plate. Pick dumbbell and place into tray (wrong). Pick dumbbell from tray and place into plate (recovery). Pick hamburg and place into tray."}
{"task_name": "9_color_block_sorting_correction", "task_description": "scene: Containers: fluted_block, dustbin. Objects: purple_block, toycar, cup_with_handle, hammer, bread./task: Sort the purple blocks into the fluted_block and the other objects into the dustbin./action: Pick purple_block and place into fluted_block. Pick toycar and place into dustbin (wrong). Pick toycar from dustbin and place into fluted_block (recovery). Pick cup_with_handle and place into dustbin. Pick hammer and place into dustbin. Pick bread and place into dustbin."}
{"task_name": "10_color_block_sorting_correction", "task_description": "scene: Containers: coaster, wooden_box. Objects: red_block, blue_block, green_block, orange_block, yellow_block, purple_block./task: Sort the primary color blocks into the coaster and the secondary color blocks into the wooden_box./action: Pick red_block and place into coaster. Pick blue_block and place into wooden_box (wrong). Pick blue_block from wooden_box and place into coaster (recovery). Pick green_block and place into coaster. Pick orange_block and place into wooden_box. Pick yellow_block and place into coaster. Pick purple_block and place into wooden_box."}
{"task_name": "11_sound_device_organization_correction", "task_description": "scene: Containers: tray, wooden_box. Objects: alarm-clock, microphone, fork, knife, mug./task: Organize the sound-producing devices into the tray and the non-sound-producing items into the wooden_box./action: Pick alarm-clock and place into tray. Pick microphone and place into tray (wrong). Pick microphone from tray and place into wooden_box (recovery). Pick fork and place into wooden_box. Pick knife and place into wooden_box. Pick mug and place into wooden_box."}
{"task_name": "12_container_usage_correction", "task_description": "scene: Containers: shoe_box, dustbin. Objects: stapler, tissue-box, toycar./task: Store office supplies in the shoe_box and toys in the dustbin./action: Pick stapler and place into shoe_box. Pick tissue-box and place into dustbin (wrong). Pick tissue-box from dustbin and place into shoe_box (recovery). Pick toycar and place into dustbin."}
{"task_name": "13_timekeeping_device_sorting_correction", "task_description": "scene: Containers: plate, shoe_box. Objects: alarm-clock, sand-clock, scanner, book./task: Place the timekeeping devices into the plate and the other objects into the shoe_box./action: Pick alarm-clock and place into plate. Pick sand-clock and place into plate (wrong). Pick sand-clock from plate and place into shoe_box (recovery). Pick scanner and place into shoe_box. Pick book and place into shoe_box."}
{"task_name": "14_timekeeping_device_organization_correction", "task_description": "scene: Containers: coaster, tray. Objects: sand-clock, french_fries, cup_with_handle, bell, microphone./task: Organize the timekeeping devices into the coaster and the other objects into the tray./action: Pick sand-clock and place into coaster. Pick bell and place into tray (wrong). Pick bell from tray and place into coaster (recovery). Pick microphone and place into tray."}
{"task_name": "15_healthy_food_organization", "task_description": "scene: Containers: fluted_block, wooden_box. Objects: apple, dumbbell, tissue-box, bottle, hamburg./task: Organize the healthy items into the fluted_block and the unhealthy items into the wooden_box./action: Pick apple and place into fluted_block. Pick dumbbell and place into wooden_box (wrong). Pick dumbbell from wooden_box and place into fluted_block (recovery). Pick tissue-box and place into wooden_box. Pick bottle and place into fluted_block. Pick hamburg and place into wooden_box."}
{"task_name": "16_tool_organization_correction", "task_description": "scene: Containers: fluted_block, dustbin. Objects: screwdriver, drill, mouse, toycar, book./task: Organize the repair tools into the fluted_block and the non-repair items into the dustbin./action: Pick screwdriver and place into fluted_block. Pick drill and place into fluted_block (wrong). Pick drill from fluted_block and place into dustbin (recovery). Pick mouse and place into dustbin."}
{"task_name": "17_healthy_food_and_office_supply_placement", "task_description": "scene: Containers: coaster, wooden_box. Objects: scanner, pot-with-plant, stapler, french_fries, sand-clock./task: Place the office supplies into the coaster and the healthy items into the wooden_box./action: Pick scanner and place into coaster. Pick pot-with-plant and place into wooden_box (wrong). Pick pot-with-plant from wooden_box and place into coaster (recovery). Pick stapler and place into coaster. Pick french_fries and place into wooden_box."}
{"task_name": "18_tool_storage_and_retrieval_correction", "task_description": "scene: Containers: shoe_box, wooden_box. Objects: mug, cup_without_handle, shampoo, cup_with_handle, hammer, bread./task: Store the tools into the shoe_box and the non-tools into the wooden_box./action: Pick hammer and place into shoe_box (wrong). Pick hammer from shoe_box and place into wooden_box (recovery). Pick mug and place into wooden_box. Pick cup_without_handle and place into wooden_box. Pick shampoo and place into wooden_box. Pick bread and place into wooden_box."}
{"task_name": "19_tool_organization_correction", "task_description": "scene: Containers: tray, dustbin. Objects: cup_without_handle, screwdriver, drill, mug, book./task: Organize the repair tools into the tray and the non-repair items into the dustbin./action: Pick screwdriver and place into tray. Pick drill and place into tray (wrong). Pick drill from tray and place into dustbin (recovery). Pick mug and place into dustbin. Pick book and place into dustbin."}
{"task_name": "20_healthy_food_placement_mistake_correction", "task_description": "scene: Containers: plate, wooden_box. Objects: apple, hamburg, fork, pot-with-plant, knife./task: Place the healthy items into the plate and the non-healthy items into the wooden_box./action: Pick apple and place into wooden_box (wrong). Pick apple from wooden_box and place into plate (recovery). Pick fork and place into wooden_box. Pick hamburg and place into wooden_box. Pick pot-with-plant and place into wooden_box. Pick knife and place into wooden_box."}
