{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: wooden_box, plate, orange_block, purple_block, cup./task: Sort the color blocks into the wooden_box based on their color categories: orange into the wooden_box and purple into the cup./action: Pick orange_block and place into wooden_box. Pick purple_block and place into cup (wrong). Pick purple_block from cup and place into wooden_box. Pick cup and place into wooden_box."}
{"task_name": "tool_storage_reorganization_correction", "task_description": "scene: On table: shoe_box, hammer, screwdriver, alarm-clock, apple, dumbbell./task: Organize the tools into the shoe_box and the non-tools onto the table./action: Pick hammer and place into shoe_box (wrong). Pick hammer from shoe_box and place on table. Pick screwdriver and place into shoe_box. Pick alarm-clock and place on table. Pick apple and place on table. Pick dumbbell and place on table."}
{"task_name": "tool_organization_correction", "task_description": "scene: On table: fluted_block, dustbin, drill, screwdriver, stapler, scanner, mouse./task: Organize the repair tools into the fluted_block and the office tools into the dustbin./action: Pick drill and place into fluted_block (wrong). Pick drill from fluted_block and place into dustbin. Pick screwdriver and place into fluted_block. Pick stapler and place into dustbin. Pick scanner and place into dustbin. Pick mouse and place into dustbin."}
{"task_name": "container_organization_correction", "task_description": "scene: On table: coaster, tray, cup_without_handle, red_block, tissue-box, mug, blue_block, sand-clock, cup_with_handle, knife./task: Organize the items into the coaster and tray based on their attributes: items with handles onto the coaster and items without handles onto the tray./action: Pick mug and place into coaster (wrong). Pick mug from coaster and place into tray. Pick cup_with_handle and place into coaster. Pick cup_without_handle and place into tray. Pick tissue-box and place into tray. Pick sand-clock and place into tray. Pick knife and place into coaster (wrong). Pick knife from coaster and place into tray."}
{"task_name": "tool_and_sound_device_classification_correction", "task_description": "scene: On table: dustbin, tool_box, bell, microphone, knife, drill, stapler, fork./task: Organize the tools into the tool_box and the sound devices into the dustbin./action: Pick knife and place into dustbin (wrong). Pick knife from dustbin and place into tool_box. Pick drill and place into tool_box. Pick bell and place into dustbin. Pick microphone and place into dustbin. Pick stapler and place into tool_box. Pick fork and place into tool_box."}
{"task_name": "healthy_food_sorting_correction", "task_description": "scene: On table: plate, shoe_box, apple, hamburg, french_fries, green_block./task: Sort the healthy and unhealthy foods into the appropriate containers./action: Pick apple and place into shoe_box (wrong). Pick apple from shoe_box and place into plate. Pick hamburg and place into shoe_box. Pick french_fries and place into shoe_box. Pick green_block and place on table."}
{"task_name": "tool_storage_correction", "task_description": "scene: On table: wooden_box, hammer, alarm-clock, bottle, microphone, mug, dumbbell, cup_without_handle./task: Store the repair tools in the wooden_box and the sound devices on the coaster./action: Pick hammer and place into wooden_box. Pick alarm-clock and place into coaster (wrong). Pick alarm-clock from wooden_box and place into coaster. Pick bottle and place into wooden_box. Pick microphone and place into coaster. Pick mug and place into wooden_box. Pick dumbbell and place into wooden_box. Pick cup_without_handle and place into wooden_box."}
{"task_name": "container_organization_correction", "task_description": "scene: On table: fluted_block, dustbin, screwdriver, bottle, dumbbell, can, french_fries, cup_with_handle, hamburg./task: Organize the metal objects into the fluted_block and the liquid containers into the dustbin./action: Pick screwdriver and place into fluted_block. Pick bottle and place into dustbin (wrong). Pick bottle from fluted_block and place into dustbin. Pick can and place into dustbin. Pick dumbbell and place into fluted_block. Pick french_fries and place into dustbin. Pick cup_with_handle and place into fluted_block. Pick hamburg and place into fluted_block."}
{"task_name": "tool_organization_correction", "task_description": "scene: On table: tray, shoe_box, hammer, alarm-clock, fork, cup_without_handle, book, tissue-box, bottle, stapler./task: Organize the repair tools into the shoe_box and the office tools into the tray./action: Pick hammer and place into shoe_box. Pick alarm-clock and place into tray (wrong). Pick alarm-clock from shoe_box and place into tray. Pick fork and place into tray. Pick cup_without_handle and place into shoe_box. Pick book and place into tray. Pick tissue-box and place into shoe_box. Pick bottle and place into shoe_box. Pick stapler and place into tray."}
{"task_name": "repair_tool_organization_correction", "task_description": "scene: On table: fluted_block, wooden_box, drill, screwdriver, hammer, sand-clock, microphone./task: Organize the repair tools into the fluted_block and the sound devices into the wooden_box./action: Pick drill and place into wooden_box (wrong). Pick drill from wooden_box and place into fluted_block. Pick screwdriver and place into fluted_block. Pick hammer and place into fluted_block. Pick sand-clock and place into wooden_box. Pick microphone and place into wooden_box."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: plate, coaster, orange_block, green_block, apple, yellow_block, red_block, pink_block, blue_block, purple_block./task: Sort the blocks by their color categories into the plate, with the primary colors on one side and the secondary colors on the other./action: Pick red_block and place into plate (wrong). Pick red_block from plate and place into coaster. Pick green_block and place into plate. Pick yellow_block and place into coaster. Pick blue_block and place into plate. Pick purple_block and place into coaster."}
{"task_name": "healthy_food_organization", "task_description": "scene: On table: tray, dustbin, apple, french_fries, hamburg, toycar, bread, tissue-box, stapler, sand-clock, alarm-clock./task: Organize the healthy and unhealthy foods into the tray and dustbin respectively./action: Pick apple and place into tray. Pick french_fries and place into tray (wrong). Pick french_fries from tray and place into dustbin. Pick hamburg and place into dustbin. Pick bread and place into tray. Pick toycar and place into dustbin."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: fluted_block, shoe_box, green_block, blue_block, yellow_block, pink_block, orange_block, purple_block./task: Sort the blocks by their color categories into the fluted_block, with the primary colors in the shoe_box./action: Pick green_block and place into shoe_box (wrong). Pick green_block from shoe_box and place into fluted_block. Pick blue_block and place into fluted_block. Pick yellow_block and place into fluted_block. Pick pink_block and place into fluted_block. Pick orange_block and place into fluted_block. Pick purple_block and place into fluted_block."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: plate, tray, red_block, yellow_block, pink_block, blue_block, purple_block./task: Sort the blocks by their color categories into the plate, with the primary colors on the left and the secondary colors on the right./action: Pick red_block and place into plate (wrong). Pick red_block from plate and place into tray. Pick blue_block and place into plate. Pick yellow_block and place into plate. Pick pink_block and place into plate. Pick purple_block and place into plate."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: plate, coaster, red_block, yellow_block, pink_block, blue_block, purple_block./task: Sort the blocks by their color categories into the plate, with the primary colors on the left and the secondary colors on the right./action: Pick red_block and place into plate (wrong). Pick red_block from plate and place into coaster. Pick yellow_block and place into plate. Pick blue_block and place into plate. Pick pink_block and place into coaster. Pick purple_block and place into coaster."}
{"task_name": "repair_tool_storage_correction", "task_description": "scene: On table: wooden_box, hammer, alarm-clock, bottle, microphone, mug, drill./task: Store the repair tools in the wooden_box and the sound devices on the coaster./action: Pick drill and place into wooden_box (wrong). Pick drill from wooden_box and place on table. Pick hammer and place into wooden_box. Pick alarm-clock and place on coaster. Pick bottle and place into wooden_box. Pick microphone and place on coaster. Pick mug and place into wooden_box."}
{"task_name": "container_storage_mistake_correction", "task_description": "scene: On table: wooden_box, tissue-box, cup_with_handle, sand-clock, can, cup_without_handle, bottle, mug, teanet./task: Store the cleaning items in the tissue-box and the liquid containers in the wooden_box./action: Pick sand-clock and place into wooden_box (wrong). Pick sand-clock from wooden_box and place into tissue-box. Pick can and place into wooden_box. Pick bottle and place into wooden_box. Pick mug and place into wooden_box."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: tray, dustbin, red_block, yellow_block, pink_block, blue_block, purple_block, green_block./task: Sort the blocks by their color categories into the tray, with the primary colors on the left and the secondary colors on the right./action: Pick red_block and place into tray. Pick yellow_block and place into tray. Pick pink_block and place into tray (wrong). Pick pink_block from tray and place into dustbin. Pick blue_block and place into tray. Pick purple_block and place into tray. Pick green_block and place into tray."}
{"task_name": "correct_food_storage", "task_description": "scene: On table: fluted_block, shoe_box, apple, french_fries, hamburg, knife, screwdriver./task: Store the healthy foods in the shoe_box and the non-food items in the fluted_block./action: Pick apple and place into shoe_box. Pick knife and place into fluted_block (wrong). Pick apple from shoe_box and place into fluted_block. Pick screwdriver and place into shoe_box."}
{"task_name": "sound_device_storage_correction", "task_description": "scene: On table: shoe_box, dustbin, microphone, bell, alarm-clock, cup_with_handle, pot-with-plant./task: Store the sound devices in the shoe_box and the non-sound items into the dustbin./action: Pick microphone and place into shoe_box (wrong). Pick microphone from shoe_box and place into dustbin. Pick bell and place into shoe_box. Pick alarm-clock and place into shoe_box. Pick cup_with_handle and place into dustbin. Pick pot-with-plant and place into dustbin."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: plate, coaster, red_block, yellow_block, pink_block, blue_block, purple_block./task: Sort the blocks by their color categories into the plate, with the primary colors on the left and the secondary colors on the right./action: Pick red_block and place into plate. Pick yellow_block and place into plate. Pick blue_block and place into plate. Pick pink_block and place into coaster (wrong). Pick pink_block from coaster and place into plate. Pick purple_block and place into plate."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: tray, wooden_box, green_block, orange_block, blue_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the tray, with the primary colors on the left and the secondary colors on the right./action: Pick green_block and place into tray. Pick orange_block and place into tray (wrong). Pick orange_block from tray and place into wooden_box. Pick blue_block and place into tray. Pick purple_block and place into tray. Pick yellow_block and place into wooden_box."}
{"task_name": "color_block_storage_correction", "task_description": "scene: On table: shoe_box, fluted_block, red_block, yellow_block, blue_block, orange_block, purple_block./task: Store the blocks with primary colors in the shoe_box and the blocks with secondary colors in the fluted_block./action: Pick red_block and place into shoe_box. Pick yellow_block and place into shoe_box (wrong). Pick yellow_block from shoe_box and place into fluted_block. Pick blue_block and place into shoe_box. Pick orange_block and place into fluted_block. Pick purple_block and place into fluted_block."}
{"task_name": "color_sorting_correction", "task_description": "scene: On table: plate, wooden_box, red_block, yellow_block, blue_block, orange_block, purple_block./task: Sort the blocks by their color categories into the plate, with the primary colors on the left and the secondary colors on the right./action: Pick red_block and place into plate (wrong). Pick red_block from plate and place into wooden_box. Pick yellow_block and place into plate. Pick blue_block and place into plate. Pick orange_block and place into wooden_box. Pick purple_block and place into wooden_box."}
{"task_name": "tool_storage_with_mistake_correction", "task_description": "scene: On table: wooden_box, dustbin, stapler, drill, screwdriver, dumbbell, sand-clock, knife, fork./task: Store the metal tools in the wooden_box and the non-metal items into the dustbin./action: Pick stapler and place into wooden_box. Pick drill and place into wooden_box (wrong). Pick drill from wooden_box and place into dustbin. Pick screwdriver and place into wooden_box. Pick dumbbell and place into dustbin. Pick sand-clock and place into dustbin. Pick knife and place into wooden_box. Pick fork and place into wooden_box."}
{"task_name": "tool_storage_correction", "task_description": "scene: On table: wooden_box, dustbin, stapler, drill, screwdriver, hammer, mug, can./task: Store the metal tools in the wooden_box and the non-metal items into the dustbin./action: Pick drill and place into wooden_box (wrong). Pick drill from wooden_box and place into dustbin. Pick hammer and place into wooden_box. Pick mug and place into dustbin. Pick can and place into dustbin."}
{"task_name": "container_organization_correction", "task_description": "scene: On table: shoe_box, tray, apple, can, french_fries, knife, cup_with_handle./task: Organize the items into the shoe_box and tray, placing all metal items in the shoe_box and all liquid containers in the tray./action: Pick apple and place into shoe_box. Pick can and place into tray. Pick french_fries and place into shoe_box (wrong). Pick french_fries from shoe_box and place into tray. Pick knife and place into shoe_box. Pick cup_with_handle and place into tray."}
{"task_name": "container_sorting_with_mistake_correction", "task_description": "scene: On table: plate, coaster, shampoo, mug, cup_with_handle, stapler, cup_without_handle, alarm-clock./task: Sort the liquid containers into the plate and the non-liquid containers onto the coaster./action: Pick shampoo and place into plate. Pick mug and place into plate. Pick stapler and place onto coaster (wrong). Pick stapler from coaster and place into plate. Pick cup_with_handle and place into plate. Pick cup_without_handle and place onto coaster."}
{"task_name": "electronic_device_organization_correction", "task_description": "scene: On table: fluted_block, dustbin, scanner, mouse, cup_without_handle, bottle, dumbbell, hamburg, tissue-box./task: Organize the electronic devices into the fluted_block and non-electronic items into the dustbin./action: Pick scanner and place into fluted_block. Pick mouse and place into fluted_block (wrong). Pick mouse from fluted_block and place into dustbin. Pick dumbbell and place into dustbin. Pick hamburg and place into dustbin."}
{"task_name": "corrected_tool_storage", "task_description": "scene: On table: tray, fluted_block, hammer, book, bottle, cup_without_handle, cup_with_handle, mouse, hamburg, french_fries./task: Store the metal tools in the fluted_block and the non-metal items in the tray./action: Pick hammer and place into fluted_block. Pick book and place into tray. Pick bottle and place into tray. Pick cup_without_handle and place into tray. Pick cup_with_handle and place into fluted_block (wrong). Pick cup_with_handle from fluted_block and place into tray. Pick mouse and place into tray. Pick hamburg and place into tray. Pick french_fries and place into tray."}
{"task_name": "tool_organization_correction", "task_description": "scene: On table: fluted_block, wooden_box, screwdriver, drill, hammer, tissue-box, alarm-clock, pot-with-plant./task: Store the repair tools in the fluted_block and the non-repair items into the wooden_box./action: Pick screwdriver and place into fluted_block. Pick drill and place into fluted_block (wrong). Pick drill from fluted_block and place into wooden_box. Pick hammer and place into fluted_block."}
{"task_name": "healthy_food_sorting_correction", "task_description": "scene: On table: plate, coaster, apple, french_fries, can, bottle, bell, microphone./task: Place the healthy foods on the plate and the unhealthy foods on the coaster./action: Pick apple and place into plate. Pick french_fries and place into coaster (wrong). Pick french_fries from coaster and place into plate. Pick can and place into coaster. Pick bottle and place into coaster. Pick bell and place into coaster. Pick microphone and place into coaster."}
{"task_name": "tool_storage_correction", "task_description": "scene: On table: shoe_box, coaster, drill, toycar, stapler, screwdriver, hammer, apple, hamburg./task: Store the metal tools in the shoe_box and the non-metal items into the coaster./action: Pick drill and place into shoe_box (wrong). Pick drill from shoe_box and place into coaster. Pick stapler and place into shoe_box. Pick screwdriver and place into shoe_box. Pick hammer and place into shoe_box. Pick apple and place into coaster. Pick hamburg and place into coaster."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: shoe_box, fluted_block, green_block, orange_block, pink_block, blue_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the shoe_box and the fluted_block, with the primary colors in the shoe_box and the secondary colors in the fluted_block./action: Pick green_block and place into shoe_box. Pick orange_block and place into shoe_box (wrong). Pick orange_block from shoe_box and place into fluted_block. Pick pink_block and place into fluted_block. Pick blue_block and place into shoe_box. Pick purple_block and place into fluted_block. Pick yellow_block and place into shoe_box."}
{"task_name": "healthy_food_organization_correction", "task_description": "scene: On table: tray, dustbin, apple, bread, hamburg, french_fries, fork, knife./task: Organize the healthy foods into the tray and the unhealthy foods into the dustbin./action: Pick apple and place into tray. Pick bread and place into tray. Pick hamburg and place into dustbin (wrong). Pick hamburg from dustbin and place into tray. Pick french_fries and place into dustbin."}
{"task_name": "healthy_food_placement_mistake_correction", "task_description": "scene: On table: plate, tray, apple, toycar, french_fries, bell./task: Place the healthy foods into the plate and the unhealthy items into the tray./action: Pick apple and place into tray (wrong). Pick apple from tray and place into plate. Pick toycar and place into tray. Pick french_fries and place into tray. Pick bell and place into tray."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: plate, coaster, green_block, pink_block, orange_block, blue_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the plate and the coaster, with the primary colors on the plate and the secondary colors on the coaster./action: Pick green_block and place into plate. Pick pink_block and place into coaster (wrong). Pick pink_block from coaster and place into plate. Pick orange_block and place into plate. Pick blue_block and place into coaster. Pick purple_block and place into coaster. Pick yellow_block and place into coaster."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: wooden_box, coaster, green_block, pink_block, orange_block, blue_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the wooden_box and the coaster, with the primary colors in the wooden_box and the secondary colors on the coaster./action: Pick green_block and place into wooden_box. Pick pink_block and place into coaster (wrong). Pick pink_block from coaster and place into wooden_box. Pick orange_block and place into wooden_box. Pick blue_block and place into coaster. Pick purple_block and place into coaster. Pick yellow_block and place into wooden_box."}
{"task_name": "tool_organization_correction", "task_description": "scene: On table: tray, dustbin, drill, screwdriver, knife, stapler, hammer, scanner, teanet./task: Organize the repair tools into the tray and the office supplies into the dustbin./action: Pick drill and place into tray. Pick screwdriver and place into tray. Pick knife and place into dustbin (wrong). Pick knife from dustbin and place into tray. Pick stapler and place into tray. Pick hammer and place into tray. Pick scanner and place into dustbin. Pick teanet and place into dustbin."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: shoe_box, fluted_block, red_block, green_block, blue_block, orange_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the shoe_box and the fluted_block, with the primary colors in the shoe_box and the secondary colors in the fluted_block./action: Pick red_block and place into shoe_box. Pick green_block and place into shoe_box. Pick blue_block and place into shoe_box (wrong). Pick blue_block from shoe_box and place into fluted_block. Pick orange_block and place into fluted_block. Pick purple_block and place into fluted_block. Pick yellow_block and place into shoe_box."}
{"task_name": "healthy_food_storage_correction", "task_description": "scene: On table: plate, dustbin, apple, hamburg, bottle, cup_without_handle, tissue-box./task: Store the healthy foods into the plate and the unhealthy items into the dustbin./action: Pick apple and place into plate. Pick hamburg and place into dustbin (wrong). Pick apple from plate and place into dustbin. Pick bottle and place into dustbin. Pick cup_without_handle and place into dustbin. Pick tissue-box and place into dustbin."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: shoe_box, coaster, red_block, green_block, blue_block, orange_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the shoe_box and the coaster, with the primary colors in the shoe_box and the secondary colors on the coaster./action: Pick red_block and place into shoe_box. Pick green_block and place into shoe_box (wrong). Pick green_block from shoe_box and place into coaster. Pick blue_block and place into shoe_box. Pick orange_block and place into coaster. Pick purple_block and place into coaster. Pick yellow_block and place into coaster."}
{"task_name": "sound_device_organization_correction", "task_description": "scene: On table: tray, wooden_box, bell, microphone, alarm-clock, fork, french_fries./task: Organize the sound-producing devices into the tray and the non-sound-producing items into the wooden_box./action: Pick bell and place into tray. Pick microphone and place into tray. Pick alarm-clock and place into tray. Pick fork and place into wooden_box (wrong). Pick fork from wooden_box and place into tray. Pick french_fries and place into wooden_box."}
{"task_name": "sound_device_organization_correction", "task_description": "scene: On table: tray, wooden_box, bell, microphone, alarm-clock, fork, french_fries./task: Organize the sound-producing devices into the tray and the non-sound-producing items into the wooden_box./action: Pick bell and place into tray. Pick microphone and place into tray. Pick alarm-clock and place into wooden_box (wrong). Pick alarm-clock from wooden_box and place into tray. Pick fork and place into wooden_box. Pick french_fries and place into wooden_box."}
{"task_name": "sound_device_classification_correction", "task_description": "scene: On table: tray, wooden_box, bell, microphone, alarm-clock, fork, sand-clock./task: Place sound-producing devices into the tray and non-sound-producing items into the wooden_box./action: Pick microphone and place into tray. Pick fork and place into wooden_box (wrong). Pick fork from wooden_box and place into tray. Pick alarm-clock and place into tray. Pick sand-clock and place into wooden_box."}
{"task_name": "container_classification_correction", "task_description": "scene: On table: plate, dustbin, cup_with_handle, bottle, mug, tissue-box, stapler, dumbbell, book, screwdriver./task: Organize the liquid containers into the plate and the non-liquid containers into the dustbin./action: Pick cup_with_handle and place into plate. Pick bottle and place into plate. Pick mug and place into plate. Pick tissue-box and place into dustbin (wrong). Pick tissue-box from dustbin and place into plate. Pick stapler and place into dustbin. Pick dumbbell and place into dustbin. Pick book and place into dustbin. Pick screwdriver and place into dustbin."}
{"task_name": "color_block_sorting_correction", "task_description": "scene: On table: shoe_box, fluted_block, red_block, green_block, blue_block, orange_block, purple_block, yellow_block./task: Sort the blocks by their color categories into the shoe_box and the fluted_block, with the primary colors into the shoe_box and the secondary colors into the fluted_block./action: Pick red_block and place into shoe_box. Pick green_block and place into shoe_box. Pick blue_block and place into shoe_box (wrong). Pick blue_block from shoe_box and place into fluted_block. Pick orange_block and place into fluted_block. Pick purple_block and place into fluted_block. Pick yellow_block and place into fluted_block."}
{"task_name": "tool_storage_repair", "task_description": "scene: On table: dustbin, shoe_box, screwdriver, stapler, apple, sand-clock, hammer, drill, bread, microphone./task: Store the repair tools into the shoe_box and the non-repair items into the dustbin./action: Pick screwdriver and place into shoe_box. Pick stapler and place into shoe_box. Pick apple and place into shoe_box (wrong). Pick apple from shoe_box and place into dustbin. Pick sand-clock and place into dustbin. Pick hammer and place into shoe_box. Pick drill and place into shoe_box. Pick bread and place into dustbin. Pick microphone and place into dustbin."}
{"task_name": "sound_device_classification_correction", "task_description": "scene: On table: wooden_box, coaster, bell, microphone, alarm-clock, fork, drill./task: Organize the sound-producing devices into the wooden_box and the non-sound-producing items into the coaster./action: Pick bell and place into wooden_box. Pick microphone and place into wooden_box. Pick alarm-clock and place into wooden_box (wrong). Pick alarm-clock from wooden_box and place into coaster. Pick fork and place into coaster. Pick drill and place into wooden_box."}
{"task_name": "liquid_container_classification_correction", "task_description": "scene: On table: fluted_block, dustbin, cup_without_handle, cup_with_handle, can, mug, cup, sand-clock./task: Organize the liquid containers into the fluted_block and the non-liquid containers into the dustbin./action: Pick cup and place into fluted_block (wrong). Pick cup from fluted_block and place into dustbin. Pick cup_with_handle and place into fluted_block. Pick can and place into fluted_block. Pick mug and place into fluted_block. Pick sand-clock and place on table. Pick knife and place into dustbin."}
